
/*
English localizable Strings for "PlcObject" table name
*/

/* PlcCommsObject */

"CommsObjectDataError" = "An error was found in received data";
"CommsObjectReachabilityError" = "Remote host could not be reached because the iOS device is neither connected to a WIFI Network or to a Cellular Data Network";
"LowLevelErrorFormatStr" = "Broken communication with the PLC due to an error (%@ %d)";
"HighLevelErrorFormatStr" = "Connection error: \"%@\"";
"NetDB_8" = "PLC address not provided, or not known" ;

/* PlcProtocol subclasses */

"ValidationFailureHeader" = "Validation Failure: %@" ;
"FoundAPLCValidationWrong" = "The Validation Tag (\"%@\") was read from the controller but verification failed. Wrong validation number.";

/* Siemens */

"kPlcTagS7ErrTagConnectionFailure" = "A connection was accepted by the Controller but PDU length negotiation Failed" ;

"kPlcTagS7ErrPDUError" = "The S7 controller reported a PDU error for this tag" ;
"kPlcTagS7ErrPDUDataError" = "The S7 controller reported a Data PDU error for this tag" ;
"kPlcTagS7ErrNoPeripheralAtAddress" = "No data from I/O module or inaccessible module" ;
"kPlcTagS7ErrMultipleBitsNotSupported" = "Reading multiple bits is not supported by CPU" ;
"kPlcTagS7ErrItemNotAvailable" = "The PLC reported item not available for tag \"%@\"" ;
"kPlcTagS7ErrAddressOutOfRange" = "Access beyond end of tag data \"%@\"" ;
"kPlcTagS7ErrWriteDataSizeMismatch" = "Write data size error" ;

/* EthernetIP */

"kPlcTagEIPErrUnknownNativeTag2" = "A Controller was found but it lacks the required \"SMValidationTag\" tag of type INT";
"kPlcTagEIPErrUnknownPcccTag2" = "A SLC/Micrologix Controller was found but it lacks the required \"N98:0\" tag of type INT";
"kPlcTagEIPErrUnknownSegmentPath2" = "An E/IP session was registered but the remote device did not support the Validation Tag (Wrong PLC type?)" ;
"kPlcTagEIPErrServiceNotSupported" = "An E/IP session was registered but the remote device lacks support for required services (Wrong PLC type?)" ;
"kPlcTagEIPErrConnectionFailure" = "An E/IP session was registered on the remote device but a Controller could not be reached (Wrong controller slot number?)" ;
"kPlcTagEIPCIPFwdOpenTimeout" = "An E/IP session was registered on the remote device but Forward Open attempt timed out (Wrong controller or incorrect path to controller)" ;
"kPlcTagEIPRegisterSessionTimeout" = "A TCP/IP link was established but E/IP Register Session attempt timed out (Ethernet/IP not supported)" ;

"kPlcTagEIPErrUnknownSegmentPath" = "The PLC reported an error for tag \"%@\" or did not recognize it";
"kPlcTagEIPErrPartialDataTransfer" = "The PLC reported response buffer overflow for tag \"%@\"";
"kPlcTagEIPErrUnknownNativeTag" = "Logix Controller reported an error for tag \"%@\" or the tag was not found";
"kPlcTagEIPErrUnknownPcccTag" = "SLC/Micrologix Controller reported an error for tag \"%@\" or did not recognize it";
/*"kPlcTagErrConnectionFailure" = "Logix Controller connection failure" ;*/
"kPlcTagEIPErrConnectionFailure" = "An E/IP session was registered on the remote device but a Controller could not be reached (Wrong controller slot number?)";
"kPlcTagEIPErrAccessBeyoundBounds" = "Access beyond end of tag data \"%@\"" ;
"kPlcTagEIPErrTagTypeMismatch" = "Type of tag \"%@\" does not match with tag found in Logix Controller";

/* Modbus */

"kPlcTagErrModbError" = "The Modbus Controller reported an error";
"kPlcTagErrModbIllegalFunction" = "Function not supported by Modbus Controller (modbus exception 01)";
"kPlcTagErrModbIllegalDataAddress" = "Modbus Data address not supported or beyond limits (modbus exception 02)";
"kPlcTagErrModbIllegalDataValue" = "Modbus Controller reported Illegal Data Value (modbus exception 03)";
"kPlcTagErrModbGatewayPathUnavailable" = "Modbus Gateway path unavailable (modbus exception 0A)";
"kPlcTagErrModbGatewayTargetFailed" = "Modbus Gateway target device failed to respond (modbus exception 0B)";

/* Omron */

"kPlcTagErrOmronFinsError" = "The Omron Controller reported an error for tag \"%@\"" ;

/* Mitsubishi */

"kPlcTagErrMitsubishiError" = "The Mitsubishi Controller reported an error for tag \"%@\"";
"kPlcTagErrMitsubishiError50h" = "The Mitsubishi Controller reported error 50h for tag \"%@\" (see FX3U-ENET manual)";
"kPlcTagErrMitsubishiError54h" = "The Mitsubishi Controller reported error 54h for tag \"%@\" (see FX3U-ENET manual)";
"kPlcTagErrMitsubishiError56h" = "The Mitsubishi Controller reported error 56h for tag \"%@\" (see FX3U-ENET manual)";
"kPlcTagErrMitsubishiError57h" = "The Mitsubishi Controller reported error 57h for tag \"%@\" (see FX3U-ENET manual)";
"kPlcTagErrMitsubishiError58h" = "The Mitsubishi Controller reported error 58h for tag \"%@\" (see FX3U-ENET manual)";
"kPlcTagErrMitsubishiError5Bh" = "The Mitsubishi Controller reported error 5Bh for tag \"%@\" (see FX3U-ENET manual)";
"kPlcTagErrMitsubishiError60h" = "The Mitsubishi Controller reported error 60h for tag \"%@\" (see FX3U-ENET manual)";

/* Opto */

"kPlcTagOPFOPowerUpClearError" = "Power-Up-Clear Error, %@";
"kPlcTagOPFOErrDefinitionUnknown" = "PAC Control Engine reported an error for tag \"%@\". Definition Unknown (-1)";
"kPlcTagOPFOErrPortLocked" = "Port Locked (-17)";
"kPlcTagOPFOErrUndefinedObject" = "PAC Control Engine reported an error for tag \"%@\". Undefined Object (-28)";
"kPlcTagOPFOErrPortLocked2" = "Port Locked (-40)";
"kPlcTagOPFOErrNullPointer" = "NULL Pointer Error (-69)";
"kPlcTagOPFOErrInvalidTableIndex" = "Access out of bounds for tag \"%@\". Invalid Table Index (-12)";
"kPlcTagOPFOErrUnespecified" = "Unespecified Error";

/* PlcTagElement */

"kPlcTagErrNone" = "OK";
"kPlcTagErrMalformedBcdTag" = "The Controller supplied a malformed or wrong BCD value";
"kPlcTagErrTagProviderError" = "Tag Provider Error, see Connections Tab" ;
"kPlcTagErrUnknownStringEncoding"= "The Controller supplied a string with unknown encoding";

"kPlcTagErrLiteVersionTagLimit" = "This tag is beyond the supported number of tags for this version of the app. Please upgrade to the full version for unlimited tags." ;
"kPlcTagErrWrongValidationTag" = "Wrong or Unsuported Validation Tag";
"kPlcTagErrTypeNotSupported" = "Unsupported or unknown data type";
"kPlcTagErrAreaNotSupported" = "Unsupported or unknown Memory Area";
"kPlcTagErrArrayTypeNotSupported" = "Non scalar data types cannot be displayed";
"kPlcTagErrSizeNotSupported" = "Data type size is too big or not supported";
/* "kPlcTagErrInvalidArrayAccess" = "Arrays must be aligned with memory area element sized boundaries" ; */
"kPlcTagErrInvalidArrayAccess" = "Misaligned access to data element. Check correspondence between data type and memory area" ;
"kPlcTagErrZeroArrayLength" = "Zero sized array" ;
"kPlcTagErrIntersectsValidationTag" = "Will not display this tag because it potentially overlaps the validation tag";
"kPlcTagScalingError" = "Scaling attributes for this Tag are wrong or cannot be used" ;
"kPlcTagInvalidCharacterInFormatString" = "Invalid character in format string" ;

"kPlcTagErrUnknown" = "Error in Tag" ;

